In [18]:
import pandas as pd

In [19]:
dados = pd.read_csv('dados/sales_train.csv')

In [20]:
dados.head()

         data  mês_consecutivo  loja_id  item_id  preço_item  venda_item_dia
0  02.01.2013                0       59    22154      999.00             1.0
1  03.01.2013                0       25     2552      899.00             1.0
2  05.01.2013                0       25     2552      899.00            -1.0
3  06.01.2013                0       25     2554     1709.05             1.0
4  15.01.2013                0       25     2555     1099.00             1.0

In [21]:
a_renomear = {
    'date' : 'data',
    'date_block_num' : 'mês_consecutivo',
    'shop_id': 'loja_id',
    'item_id' : 'item_id',
    'item_price' : 'preço_item',
    'item_cnt_day' : 'venda_item_dia' 
}
dados = dados.rename(columns=a_renomear)

In [23]:
a_renomear = {
    'mês_consecutivo' : 'mes_consecutivo',
    'preço_item' : 'preco_item', 
}
dados = dados.rename(columns=a_renomear)

In [24]:
dados.head()

         data  mes_consecutivo  loja_id  item_id  preco_item  venda_item_dia
0  02.01.2013                0       59    22154      999.00             1.0
1  03.01.2013                0       25     2552      899.00             1.0
2  05.01.2013                0       25     2552      899.00            -1.0
3  06.01.2013                0       25     2554     1709.05             1.0
4  15.01.2013                0       25     2555     1099.00             1.0

In [10]:
dados.shape

(2935849, 6)

In [11]:
dados_teste = pd.read_csv('dados/test.csv')

In [12]:
dados_teste.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [13]:
dados.isnull().sum()

data               0
mês_consecutivo    0
loja_id            0
item_id            0
preço_item         0
venda_item_dia     0
dtype: int64

In [14]:
dados_teste.isnull().sum()

ID         0
shop_id    0
item_id    0
dtype: int64

In [25]:
dados.to_csv('dados/sales_train.csv',index=False)